app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "post_id", "created_at") VALUES('2009-07-27 07:17:05', 'a ver si pasa ahora algo', 1, '2009-07-27 07:17:05')
---
 def create
	@post = Post.find(params[:post_id])
	@comment = @post.comments.create!(params[:comment])