app/controllers/posts_controller.rb

INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-07-27 05:09:21', 'hola soy una lina en rails', 'fui creado por scaffold y alfin me salen sin fallas jaja suerte para todos.', '2009-07-27 05:09:21')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'fui creado por scaffold y alfin me salen sin fallas jaja suerte para todos.
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])