app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "username", "password_salt", "password_hash", "email", "created_at") VALUES('2010-05-23 04:33:05', 'maxwell', '522f245d0bb522e3594c014f5ed182f61dbe8989', 'a6501784681a6a24e6d84fa062cd1156f14240c7', 'maxwellweb@gmail.com', '2010-05-23 04:33:05')
---
  def create
    @user = User.new(params[:user])
    if verify_recaptcha(:model => @user, :message => 'leena mejor nderasatu mbae') and @user.save